ca2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
        (  0	0    0)
    	(  10   0	 0)
        (  10	0.9  0)
        (  0 	0.9  0)

		(  0	0     4.5)
    	(  10	0     4.5)
        (  10	0.9   4.5)
        (  0  	0.9   4.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 1 45) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
			(0 4 7 3)
        );
    }
	
    outlet
    {
        type wall;
        faces
        (
			(2 6 5 1)
        );
    }
	
    ground
    {
        type wall;
        faces
        (
			(0 3 2 1)
        );
    }
	
	
    frontandback
    {
        type empty;
        faces
        (
			(1 5 4 0)
            (3 7 6 2)
        );
    }
	
    atmosphere
    {
        type wall;
        faces
        (
			(4 5 6 7)
        );
    }
    floatingObject
    {
        type wall;
        faces ();
    }
    
);

mergePatchPairs
(
);

// ************************************************************************* //
