ca2/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicMotionSolverFvMesh;

motionSolverLibs    ("libsixDoFRigidBodyMotionCoupled.so");

motionSolver        sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
    patches         (floatingObject);
    innerDistance   0.003;	//0.01L
    outerDistance   0.3;	//1L

    centreOfMass    (2 0.45 0.05);

    // Cylinder dimensions
    length          0.01;
    width           0.9;
	height			0.01;
	
    // Density of the solid
//    rhoSolid        500.0;

    // Cylinder mass
	mass            13.5;	
	
    //moment of inertia about the centre of mass

	momentOfInertia (1.9352 0.236 2.124);
	
    report          on;
	reportToFile    on;
    accelerationRelaxation 	0.95;
    accelerationDamping 	1.00;
	tightlyType		2;
	tightlyMoment	false;
	
    solver
    {
        type Newmark;
    }

    constraints
    {
		 AxisConstraint
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis (0 1 0);
        }

    }
	restraints
	{
			cable1
			{
				sixDoFRigidBodyMotionRestraint	catenary;
				anchor 							(0.31 0.45 0);
				refAttachmentPt					(0.3 0.45 4.5);
				restLength						3.5;
				Cable_no						1;
			}
			
	}
	
}


// ************************************************************************* //
