ca2/system/pointLocation1.txt
( 0.310 0.450 0.000 )
( 0.309 0.450 0.225 )
( 0.309 0.450 0.450 )
( 0.308 0.450 0.675 )
( 0.308 0.450 0.900 )
( 0.307 0.450 1.125 )
( 0.307 0.450 1.350 )
( 0.306 0.450 1.575 )
( 0.306 0.450 1.800 )
( 0.305 0.450 2.025 )
( 0.305 0.450 2.250 )
( 0.304 0.450 2.475 )
( 0.304 0.450 2.700 )
( 0.303 0.450 2.925 )
( 0.303 0.450 3.150 )
( 0.302 0.450 3.375 )
( 0.302 0.450 3.600 )
( 0.301 0.450 3.825 )
( 0.301 0.450 4.050 )
( 0.300 0.450 4.275 )
( 0.300 0.450 4.500 )
